Catalogs/РасходыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РасходыПериода</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьВНОБДляНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения5</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение5</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСтрокиПриложенияОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РасходыПериода/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если не ЭтоГруппа Тогда 
		Если ВозвращатьВНОБДляНалогаНаПрибыль Тогда 
			ПроверяемыеРеквизиты.добавить("ГрафаПриложения1");
		КонецЕсли;	
		
		Если Приложение3 Тогда 
			ПроверяемыеРеквизиты.добавить("ГрафаПриложения3");
		КонецЕсли;
		
		Если Приложение5 Тогда 
			ПроверяемыеРеквизиты.добавить("ГрафаПриложения5");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

//Процедура ПриЗаписи(Отказ)
//	ДанныеИзРегистраСведений = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СрезПоследних(ТекущаяДата(),новый структура("СтатьяЗатрат",Ссылка));
//	
//	Если ДанныеИзРегистраСведений.Количество()= 0 Тогда
//		Если ВозвращатьВНОБДляНалогаНаПрибыль или Приложение3 или Приложение5 Тогда 
//			НовыйНаборЗаписей = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СоздатьНаборЗаписей();
//			НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
//			НоваяЗаписьНабора.Период = '1900.01.01';
//			НоваяЗаписьНабора.СтатьяЗатрат = Ссылка ;
//			НоваяЗаписьНабора.НеВычетаемыеРасходыВключаемыеНОБ = ВозвращатьВНОБДляНалогаНаПрибыль;
//			НоваяЗаписьНабора.СтрокаПриложения3 = ГрафаПриложения1;
//			НоваяЗаписьНабора.НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода = Приложение3;
//			НоваяЗаписьНабора.СтрокаПриложения4 = ГрафаПриложения3;
//			НоваяЗаписьНабора.УменьшениеНОБ  = Приложение5;
//			НоваяЗаписьНабора.СтрокаПриложения7 = ГрафаПриложения5;
//			НовыйНаборЗаписей.Записать();
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
